Revit 2027 API
IRebarUpdateServer.GetHandlesPosition Method
This function is supposed to provide the positions of handles defined in GetCustomHandles(). These positions will be shown on screen when the bar constraints are edited. If a position for a handle isn't provided, that handle will not be represented on screen while edit constraints.
This function is called when edit constraints command is lunched or during edit constraints after a constraint was changed and the curve calculation was done.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool GetHandlesPosition(
	RebarHandlePositionData handlePositionData
)
Function GetHandlesPosition (
	handlePositionData As RebarHandlePositionData
) As Boolean
bool GetHandlesPosition(
	RebarHandlePositionData^ handlePositionData
)
abstract GetHandlesPosition :
        handlePositionData : RebarHandlePositionData -> bool
Parameters
handlePositionData RebarHandlePositionData
 Use the members of this class to access the inputs and define the handle positions for this free form rebar.
Return Value
Boolean
 Returns true if calculation of handle positions was successful, false otherwise.
See Also
Reference
IRebarUpdateServer Interface
Autodesk.Revit.DB.Structure Namespace